note/drawio/converted/dot/260506-ultrasonic-sensor-asm.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_pyArTMUBqx2ekubFKROX_1" [label="node_KROX-1"];
  "n_pyArTMUBqx2ekubFKROX_12" [label="tick_cnt >= 11"];
  "n_pyArTMUBqx2ekubFKROX_2" [label="echo ==0"];
  "n_pyArTMUBqx2ekubFKROX_23" [label="node_ROX-23"];
  "n_pyArTMUBqx2ekubFKROX_3" [label="Respose"];
  "n_pyArTMUBqx2ekubFKROX_33" [label="trig =0"];
  "n_pyArTMUBqx2ekubFKROX_34" [label="trig =0"];
  "n_pyArTMUBqx2ekubFKROX_4" [label="node_KROX-4"];
  "n_pyArTMUBqx2ekubFKROX_40" [label="Ｆ"];
  "n_pyArTMUBqx2ekubFKROX_41" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_42" [label="node_ROX-42"];
  "n_pyArTMUBqx2ekubFKROX_43" [label="tick_us == 1"];
  "n_pyArTMUBqx2ekubFKROX_44" [label="tick_cnt +1"];
  "n_pyArTMUBqx2ekubFKROX_48" [label="node_ROX-48"];
  "n_pyArTMUBqx2ekubFKROX_49" [label="tick_us == 1"];
  "n_pyArTMUBqx2ekubFKROX_5" [label="tick_cnt ++"];
  "n_pyArTMUBqx2ekubFKROX_53" [label="tick_cnt = 0"];
  "n_pyArTMUBqx2ekubFKROX_56" [label="tick_us == 1"];
  "n_pyArTMUBqx2ekubFKROX_60" [label="node_ROX-60"];
  "n_pyArTMUBqx2ekubFKROX_61" [label="tick_cnt /58"];
  "n_pyArTMUBqx2ekubFKROX_65" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_66" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_67" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_68" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_69" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_70" [label="Ｔ"];
  "n_pyArTMUBqx2ekubFKROX_72" [label="F"];
  "n_pyArTMUBqx2ekubFKROX_74" [label="F"];
  "n_pyArTMUBqx2ekubFKROX_76" [label="F"];
  "n_pyArTMUBqx2ekubFKROX_78" [label="F"];
  "n_pyArTMUBqx2ekubFKROX_80" [label="F"];
  "n_pyArTMUBqx2ekubFKROX_82" [label="F"];
  "n_pyArTMUBqx2ekubFKROX_83" [label="<distance>"];
  "n_qU6jsDxPJs_IhxhBXcGn_1" [label="node_XcGn-1"];
  "n_qU6jsDxPJs_IhxhBXcGn_10" [label="WAIT"];
  "n_qU6jsDxPJs_IhxhBXcGn_11" [label="node_cGn-11"];
  "n_qU6jsDxPJs_IhxhBXcGn_13" [label="node_cGn-13"];
  "n_qU6jsDxPJs_IhxhBXcGn_14" [label="trig = 1"];
  "n_qU6jsDxPJs_IhxhBXcGn_17" [label="node_cGn-17"];
  "n_qU6jsDxPJs_IhxhBXcGn_18" [label="echo ==1"];
  "n_qU6jsDxPJs_IhxhBXcGn_2" [label="IDLE"];
  "n_qU6jsDxPJs_IhxhBXcGn_3" [label="node_XcGn-3"];
  "n_qU6jsDxPJs_IhxhBXcGn_4" [label="START"];
  "n_qU6jsDxPJs_IhxhBXcGn_5" [label="node_XcGn-5"];
  "n_qU6jsDxPJs_IhxhBXcGn_6" [label="sr04_start == 1"];
  "n_qU6jsDxPJs_IhxhBXcGn_9" [label="node_XcGn-9"];
  "n_qU6jsDxPJs_IhxhBXcGn_5" -> "n_qU6jsDxPJs_IhxhBXcGn_3";
  "n_qU6jsDxPJs_IhxhBXcGn_9" -> "n_pyArTMUBqx2ekubFKROX_33";
  "n_qU6jsDxPJs_IhxhBXcGn_13" -> "n_qU6jsDxPJs_IhxhBXcGn_9";
  "n_qU6jsDxPJs_IhxhBXcGn_17" -> "n_pyArTMUBqx2ekubFKROX_53";
  "n_pyArTMUBqx2ekubFKROX_1" -> "n_pyArTMUBqx2ekubFKROX_60";
  "n_pyArTMUBqx2ekubFKROX_53" -> "n_qU6jsDxPJs_IhxhBXcGn_11";
  "n_pyArTMUBqx2ekubFKROX_60" -> "n_qU6jsDxPJs_IhxhBXcGn_1";
}
